org/core.org
#+title: OpenACS on Ubuntu.
* Auxiliary Information                                            :noexport:
:PROPERTIES:
:CUSTOM_ID: auxiliary-information
:END:
The setupfile contain global common property configuration:
#+SETUPFILE: .configuration/global_vars_org.setup
#+SETUPFILE: .configuration/global_property_org.setup
#+SETUPFILE: .configuration/global_vars_html.setup
#+EXPORT_FILE_NAME: ../Readme
#+OPTIONS: auto-id:t

* About
:PROPERTIES:
:CUSTOM_ID: about
:END:
This is [[https://openacs.org/][OpenACS]] on [[https://hub.docker.com/_/ubuntu][Ubuntu base docker image]] (version 22.04) .  To install OpenACS I used  code from  [[https://github.com/gustafn/install-ns][Gustaf Neumann]] script [[https://github.com/gustafn/install-ns/blob/master/install-oacs.sh][install-oacs.sh]]. The base image is [[https://hub.docker.com/r/oupfiz5/openacs][oupfiz5/openacs]]

OpenACS is self-hosting at https://chiselapp.com/user/oupfiz5/repository/openacs.

If you are reading this on GitHub, then you are looking at a Git mirror of the self-hosting OpenACS repository.  The purpose of that mirror is to test and exercise Fossil's ability to export a Git mirror and using GitHub CI/CD  (GitHub Actions). Nobody much uses the GitHub mirror, except to verify that the mirror logic works. If you want to know more about OpenACS, visit the official self-hosting site linked above.
* Table of Contents :TOC_3:noexport:
:PROPERTIES:
:CUSTOM_ID: table-of-contents
:END:
- [[#about][About]]
- [[#prerequisite][Prerequisite]]
  - [[#tools][Tools]]
  - [[#third-party-tools][Third party tools]]
- [[#installation][Installation]]
  - [[#build-from-chiselapp-fossil][Build from chiselapp (fossil)]]
  - [[#download-from-dockerhub][Download from DockerHub]]
  - [[#build-from-github][Build from GitHub]]
  - [[#contfiguration][Contfiguration]]
    - [[#build-arguments][Build arguments]]
    - [[#example-of-build][Example of build]]
- [[#quickstart][Quickstart]]
  - [[#manage-openacs-using-docker-compose][Manage OpenACS using docker-compose]]
    - [[#prerequisite-1][Prerequisite]]
    - [[#startstop-interactive][Start/stop interactive]]
    - [[#startstopremove-as-daemon][Start/stop/remove as daemon]]
    - [[#view-logs][View logs]]
    - [[#view-list-containers][View list containers]]
    - [[#prune-all][Prune all]]
- [[#configuration-options][Configuration options]]
  - [[#general-options][General options]]
  - [[#oacs_-variables][oacs_* variables]]
  - [[#openacs-listen-port][OpenACS listen port]]
  - [[#openacs-docker-image][OpenACS docker image]]
  - [[#naviserver-configuration-file][NaviServer configuration file]]
  - [[#postgresql-docker-image][PostgreSQL docker image]]
  - [[#database-hostname][Database hostname]]
  - [[#database-name][Database name]]
  - [[#database-username][Database username]]
  - [[#database-password][Database password]]
  - [[#postgres-tag][Postgres tag]]
  - [[#timezone][Timezone]]
- [[#cicd][CI/CD]]
- [[#maintenance][Maintenance]]
  - [[#shell-access][Shell access]]

* Prerequisite
:PROPERTIES:
:CUSTOM_ID: prerequisite
:END:
** Tools
:PROPERTIES:
:CUSTOM_ID: tools
:END:
1. *nix operation system
2. Install Docker
3. Install git (optional)
4. Install fossil (optional)
** Third party tools
:PROPERTIES:
:CUSTOM_ID: third-party-tools
:END:
They are using for testing and scanning:
1. [[https://github.com/bats-core][Bats]]
2. [[https://www.shellcheck.net/][Shellcheck]]
3. [[https://github.com/hadolint/hadolint][Hadolynt]]
4. [[https://github.com/goodwithtech/dockle][Dockle]]
5. Snyk - not necessarily
6. Trivy - not necessarily
* Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:

** Build from chiselapp (fossil)
:PROPERTIES:
:CUSTOM_ID: build-from-chiselapp--fossil-
:END:
#+begin_src sh :tangle no :noweb yes
  fossil clone https://chiselapp.com/user/oupfiz5/repository/openacs openacs.fossil
  mkdir openacs
  cd openacs
  fossil open ../openacs.fossil
  docker build -t oupfiz5/openacs -f ./Dockerfile .
#+end_src

** Download from DockerHub
:PROPERTIES:
:CUSTOM_ID: download-from-dockerhub
:END:
You can download docker images from dockerhub:
#+begin_src sh :tangle no :noweb yes
  docker pull oupfiz5/openacs:oacs-5-10
#+end_src

** Build from GitHub
:PROPERTIES:
:CUSTOM_ID: build-from-github
:END:
#+begin_src sh :tangle no :noweb yes
  git clone https://github.com/oupfiz5/openacs.git
  cd openacs
  docker build -t oupfiz5/openacs -f ./Dockerfile .
#+end_src

** Contfiguration
:PROPERTIES:
:CUSTOM_ID: contfiguration
:END:
*** Build arguments
:PROPERTIES:
:CUSTOM_ID: build-arguments
:END:
 |---------------------+-----------------------+---------------------------|
 | Arguments           | Default               | Description               |
 |---------------------+-----------------------+---------------------------|
 | BUILD_DATE          | none                  | Set build date for label  |
 |---------------------+-----------------------+---------------------------|
 | OACS_TAG            | oacs-5-10             | Set OpenACS version       |
 |---------------------+-----------------------+---------------------------|
 | NS_IMAGE_TAG        | 4.99.24               | Set NaviServer version    |
 |---------------------+-----------------------+---------------------------|
 | NS_IMAGE_REPOSITORY | oupfiz5               | Set NaviServer repository |
 |---------------------+-----------------------+---------------------------|
 | NS_IMAGE_NAME       | naviserver            | Set NaviServer image name |
 |---------------------+-----------------------+---------------------------|
 | IMAGE_NAME          | openacs               | Set OpenaACS image name   |
 |---------------------+-----------------------+---------------------------|
 | IMAGE_REPOSITORY    | oupfiz5               | Set OpenACS repository    |
 |---------------------+-----------------------+---------------------------|
 | IMAGE_TAG           | oacs-5-10             | Set OpenACS image tag     |
 |---------------------+-----------------------+---------------------------|
*** Example of build
:PROPERTIES:
:CUSTOM_ID: example-of-build
:END:

#+begin_src sh :tangle no :noweb yes :dir ../src
set -a; source ../VERSIONS ; set +a;
IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
docker build --no-cache \
    --build-arg BUILD_DATE=$(date -u +"%Y-%m-%dT%H:%M:%SZ") \
    --build-arg OACS_TAG="oacs-5-10" \
    -t "${IMAGE}" \
    -f ./Dockerfile \
    .
#+end_src

* Quickstart
:PROPERTIES:
:CUSTOM_ID: quickstart
:END:
** Manage OpenACS using docker-compose
:PROPERTIES:
:CUSTOM_ID: manage-openacs-using-docker-compose
:END:
*** Prerequisite
:PROPERTIES:
:CUSTOM_ID: prerequisite
:END:
Clone repository from:
- fossil:
  #+begin_src sh :tangle no :noweb yes
fossil clone https://chiselapp.com/user/oupfiz5/repository/openacs openacs.fossil
mkdir openacs
cd openacs
fossil open ../openacs.fossil
  #+end_src

- GitHub:
  #+begin_src sh :tangle no :noweb yes
git clone https://github.com/oupfiz5/openacs.git
cd openacs
  #+end_src
*** Start/stop interactive
:PROPERTIES:
:CUSTOM_ID: start-stop-interactive
:END:
start:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose up
#+end_src

The site will be accessible by url  http://localhost:8080.

stop:
#+begin_example
<Ctrl>+C
#+end_example

*** Start/stop/remove as daemon
:PROPERTIES:
:CUSTOM_ID: start-stop-remove-as-daemon
:END:
start :
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose up -d
#+end_src

The site will be accessible by url  http://localhost:8080.

stop:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose down
#+end_src

remove:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose rm
#+end_src

*** View logs
:PROPERTIES:
:CUSTOM_ID: view-logs
:END:
Logs follow:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose logs -f
#+end_src

Logs tail:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose logs --tail=10
#+end_src
*** View list containers
:PROPERTIES:
:CUSTOM_ID: view-list-containers
:END:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker-compose ps
#+end_src

*** Prune all
:PROPERTIES:
:CUSTOM_ID: prune-all
:END:
#+begin_src sh :tangle no :noweb yes :dir ../src/
docker system prune --volumes --force
#+end_src

* Configuration options
:PROPERTIES:
:CUSTOM_ID: configuration-options
:END:
