Readme.md

# Table of Contents

-   [About](#about)
-   [Prerequisite](#prerequisite)
    -   [Tools](#tools)
    -   [Third party tools](#third-party-tools)
-   [Installation](#installation)
    -   [Build from chiselapp (fossil)](#build-from-chiselapp--fossil-)
    -   [Download from DockerHub](#download-from-dockerhub)
    -   [Build from GitHub](#build-from-github)
    -   [Contfiguration](#contfiguration)
        -   [Build arguments](#build-arguments)
        -   [Example of build](#example-of-build)
-   [Quickstart](#quickstart)
    -   [Manage OpenACS using docker-compose](#manage-openacs-using-docker-compose)
        -   [Prerequisite](#prerequisite)
        -   [Start/stop interactive](#start-stop-interactive)
        -   [Start/stop/remove as daemon](#start-stop-remove-as-daemon)
        -   [View logs](#view-logs)
        -   [View list containers](#view-list-containers)
        -   [Prune all](#prune-all)
-   [Configuration options](#configuration-options)
    -   [General options](#general-options)
    -   [oacs\_\* variables](#oacs---variables)
    -   [OpenACS listen port](#openacs-listen-port)
    -   [OpenACS docker image](#openacs-docker-image)
    -   [NaviServer configuration file](#naviserver-configuration-file)
    -   [PostgreSQL docker image](#postgresql-docker-image)
    -   [Database hostname](#database-hostname)
    -   [Database name](#database-name)
    -   [Database username](#database-username)
    -   [Database password](#database-password)
    -   [Postgres tag](#postgres-tag)
    -   [Timezone](#timezone)
-   [CI/CD](#ci-cd)
-   [Maintenance](#maintenance)
    -   [Shell access](#shell-access)



<a id="about"></a>

# About

This is [OpenACS](https://openacs.org/) on [Ubuntu base docker image](https://hub.docker.com/_/ubuntu) (version 22.04) .  To install OpenACS I used  code from  [Gustaf Neumann](https://github.com/gustafn/install-ns) script [install-oacs.sh](https://github.com/gustafn/install-ns/blob/master/install-oacs.sh). The base image is [oupfiz5/openacs](https://hub.docker.com/r/oupfiz5/openacs)

OpenACS is self-hosting at <https://chiselapp.com/user/oupfiz5/repository/openacs>.

If you are reading this on GitHub, then you are looking at a Git mirror of the self-hosting OpenACS repository.  The purpose of that mirror is to test and exercise Fossil's ability to export a Git mirror and using GitHub CI/CD  (GitHub Actions). Nobody much uses the GitHub mirror, except to verify that the mirror logic works. If you want to know more about OpenACS, visit the official self-hosting site linked above.


<a id="prerequisite"></a>

# Prerequisite


<a id="tools"></a>

## Tools

1.  \*nix operation system
2.  Install Docker
3.  Install git (optional)
4.  Install fossil (optional)


<a id="third-party-tools"></a>

## Third party tools

They are using for testing and scanning:

1.  [Bats](https://github.com/bats-core)
2.  [Shellcheck](https://www.shellcheck.net/)
3.  [Hadolynt](https://github.com/hadolint/hadolint)
4.  [Dockle](https://github.com/goodwithtech/dockle)
5.  Snyk - not necessarily
6.  Trivy - not necessarily


<a id="installation"></a>

# Installation


<a id="build-from-chiselapp--fossil-"></a>

## Build from chiselapp (fossil)

    fossil clone https://chiselapp.com/user/oupfiz5/repository/openacs openacs.fossil
    mkdir openacs
    cd openacs
    fossil open ../openacs.fossil
    docker build -t oupfiz5/openacs -f ./Dockerfile .


<a id="download-from-dockerhub"></a>

## Download from DockerHub

You can download docker images from dockerhub:

    docker pull oupfiz5/openacs:oacs-5-10


<a id="build-from-github"></a>

## Build from GitHub

    git clone https://github.com/oupfiz5/openacs.git
    cd openacs
    docker build -t oupfiz5/openacs -f ./Dockerfile .


<a id="contfiguration"></a>

## Contfiguration


<a id="build-arguments"></a>

### Build arguments

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">BUILD_DATE</td>
<td class="org-left">none</td>
<td class="org-left">Set build date for label</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">OACS_TAG</td>
<td class="org-left">oacs-5-10</td>
<td class="org-left">Set OpenACS version</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">NS_IMAGE_TAG</td>
<td class="org-left">4.99.24</td>
<td class="org-left">Set NaviServer version</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">NS_IMAGE_REPOSITORY</td>
<td class="org-left">oupfiz5</td>
<td class="org-left">Set NaviServer repository</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">NS_IMAGE_NAME</td>
<td class="org-left">naviserver</td>
<td class="org-left">Set NaviServer image name</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">IMAGE_NAME</td>
<td class="org-left">openacs</td>
<td class="org-left">Set OpenaACS image name</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">IMAGE_REPOSITORY</td>
<td class="org-left">oupfiz5</td>
<td class="org-left">Set OpenACS repository</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">IMAGE_TAG</td>
<td class="org-left">oacs-5-10</td>
<td class="org-left">Set OpenACS image tag</td>
</tr>
</tbody>
</table>


<a id="example-of-build"></a>

### Example of build

    set -a; source ../VERSIONS ; set +a;
    IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
    docker build --no-cache \
        --build-arg BUILD_DATE=$(date -u +"%Y-%m-%dT%H:%M:%SZ") \
        --build-arg OACS_TAG="oacs-5-10" \
        -t "${IMAGE}" \
        -f ./Dockerfile \
        .


<a id="quickstart"></a>

# Quickstart


<a id="manage-openacs-using-docker-compose"></a>

## Manage OpenACS using docker-compose


<a id="prerequisite"></a>

### Prerequisite

Clone repository from:

-   fossil:
    
        fossil clone https://chiselapp.com/user/oupfiz5/repository/openacs openacs.fossil
        mkdir openacs
        cd openacs
        fossil open ../openacs.fossil

-   GitHub:
    
        git clone https://github.com/oupfiz5/openacs.git
        cd openacs


<a id="start-stop-interactive"></a>

### Start/stop interactive

start:

    docker-compose up

The site will be accessible by url  <http://localhost:8080>.

stop:

    <Ctrl>+C


<a id="start-stop-remove-as-daemon"></a>

### Start/stop/remove as daemon

start :

    docker-compose up -d

The site will be accessible by url  <http://localhost:8080>.

stop:

    docker-compose down

remove:

    docker-compose rm


<a id="view-logs"></a>

### View logs

Logs follow:

    docker-compose logs -f

Logs tail:

    docker-compose logs --tail=10


<a id="view-list-containers"></a>

### View list containers

    docker-compose ps


<a id="prune-all"></a>

### Prune all

    docker system prune --volumes --force
